Tirta7/voc_master_data_center/esp32_mqtt_client - Copy/KODINGAN_ESP32_PCF8575_SPOT_ON_BILLIARD_SIDOARJO_PORTAL.ino
/*
 * IoT Relay Controller dengan ESP32 + N PCF8575 + Reverb WebSocket
 * -------------------------------------------------------------
 * Fitur:
 * - 30 relay dikendalikan via 2 modul PCF8575 (I2C)
 * - Mode Manual (semua relay mati) dan Otomatis (dikendalikan via WebSocket)
 * - Persistensi status relay via SPIFFS (dengan recovery otomatis)
 * - Koneksi ke server Reverb (Pusher-compatible) via WebSocket
 * - Animasi test & warning tanpa delay (non-blocking)
 * - Penanganan error I2C dan koneksi jaringan
 * - Validasi waktu untuk mencegah warning prematur: hanya jika waktu tersisa <= 5 menit
 * 
 * Hardware:
 * - ESP32 DevKit V1
 * - 2x PCF8575: alamat 0x21 (relay 1-16), 0x22 (relay 17-30)
 * - Mode switch on GPIO 5 (INPUT_PULLUP): HIGH = Otomatis | LOW = Manual
 * - Buzzer on GPIO 19
 * - WiFi LED on GPIO 2
 * - External power transistor on GPIO 4
 * - Relay control enable (PCF power) on GPIO 15 (active-high)
 * 
 * Oleh: Tirta Aditya
 * Tanggal: 25 November 2025
 * LOKASI: BALLISTIC SURABAYA
 */

#include <WiFi.h>
#include <WebSocketsClient.h>
#include <ArduinoJson.h>
#include <SPIFFS.h>
#include <WebServer.h>
#include <DNSServer.h>
#include <esp_wifi.h>
#include <esp_task_wdt.h>
#include "Wire.h"
#include "PCF8575.h"

// Variabel Konfigurasi Sistem
String config_ssid = "";
String config_password = "";
String config_host_ip = "192.168.1.199";
int pin_mode_switch = 5;
int pin_transistor = 4;
int pin_relay_control = 15;
int pin_led_wifi = 2;
int pin_buzzer = 19;
int config_num_pcf = 2;
String config_pcf_addrs = "0x21,0x22";
uint8_t pcfAddresses[8] = {0x21, 0x22, 0, 0, 0, 0, 0, 0};

const char* CONFIG_FILE = "/relay_config.json";
const char* SYSTEM_CONFIG_FILE = "/system_config.json";

// KONFIGURASI PCF8575 akan dimuat dari sistem config
#define NUM_PCF config_num_pcf

// ─────────────────────────────────────────────────────────────
// KONFIGURASI RELAY
// ─────────────────────────────────────────────────────────────
const uint8_t NUM_RELAYS_PER_PCF = 16;
const uint8_t NUM_TOTAL_RELAYS = 19; // Relay 1-30 → index 0-29

// ─────────────────────────────────────────────────────────────
// KONFIGURASI VALIDASI WARNING
// ─────────────────────────────────────────────────────────────
const unsigned long MIN_TIME_BEFORE_WARNING_MS = 10000UL;
const unsigned long WARNING_THRESHOLD_MS = 5UL * 60UL * 1000UL;

// Pin Hardware akan diinisialisasi dari konfigurasi
#define MODE_SWITCH    pin_mode_switch
#define TRANSISTOR_PIN pin_transistor
#define RELAY_CONTROL  pin_relay_control
#define LED_WIFI       pin_led_wifi
#define BUZZER         pin_buzzer

// ─────────────────────────────────────────────────────────────
// OBJEK & VARIABEL GLOBAL
// ─────────────────────────────────────────────────────────────
PCF8575** pcfModules = nullptr;
bool relayState[128] = {false};
bool relayStateBackup[128] = {false};
unsigned long relayActivationTime[128] = {0};
unsigned long relayEndTime[128] = {0};
unsigned long relayProtectedUntil[128] = {0}; // 🛡️ Anti-race condition: proteksi relay setelah perintah ON

bool storageDirty = false;
unsigned long lastStateChange = 0;
const unsigned long STORAGE_SAVE_DELAY = 3000;

bool modeOtomatis = true;
bool wifiConnected = false;
bool wsConnected = false;          // 🛡️ Status koneksi WebSocket level aplikasi
unsigned long lastWiFiCheck = 0;
unsigned long lastPing = 0;
unsigned long lastHeartbeat = 0;
const unsigned long pingInterval = 25000;
const unsigned long HEARTBEAT_INTERVAL = 60000; // Heartbeat level-aplikasi ke server

bool buzzerActive = false;
unsigned long buzzerEndTime = 0;

enum TestState {
  IDLE,
  RUNNING_LIGHT_ON,
  RUNNING_LIGHT_END,
  WARNING_BLINK
};
TestState currentState = IDLE;
unsigned long stateStartTime = 0;
int testStep = 0;
uint8_t warningCode = 0;
int warningBlinkCount = 0;

DynamicJsonDocument doc(2048);
DynamicJsonDocument dataDoc(2048);
// loadDoc dan saveDoc dialokasikan dinamis secara lokal

// Reverb config akan diambil dari config_host_ip
const int reverb_port = 6061;
const char* reverb_app_key = "pjdishtaa3yp4doumbyy";

const char* pusher_channel = "iot.channel";
const char* pusher_channel_warn = "iot.warn.channel";
const char* pusher_channel_check = "iot.check.channel";
const char* pusher_channel_test = "iot.test.channel";

const char* subscribeTemplate = "{\"event\":\"pusher:subscribe\",\"data\":{\"channel\":\"%s\"}}";
const char* pusherChannels[] = {
  pusher_channel, pusher_channel_check, pusher_channel_warn, pusher_channel_test
};
const size_t numPusherChannels = sizeof(pusherChannels) / sizeof(pusherChannels[0]);

const char* pusher_event_connec = "lamp.connection";
const char* pusher_event_check = "lamp.check";
const char* pusher_event_warn = "lamp.warn";
const char* pusher_event_test = "lamp.test";

WebSocketsClient webSocket;
WebServer server(80);
DNSServer dnsServer;
bool portalActive = false;
const byte DNS_PORT = 53;

// ─────────────────────────────────────────────────────────────
// FUNCTION PROTOTYPES
// ─────────────────────────────────────────────────────────────
void LoadRelayConfigSPIFFS();
void SaveRelayConfigSPIFFS();
void LoadSystemConfig();
void SaveSystemConfig();
void startPortal();
void handlePortalRoot();
void handlePortalSave();
void handlePortalScan();
void connectToWiFi();
void ConnectWebSocket();
void cekWiFi(unsigned long currentMillis);
void WebSocketEvent(WStype_t type, uint8_t* payload, size_t length);
void PowerRelayByWebSocket(uint8_t code, const char* status, unsigned long durationMs = 0);
void PowerRelayByWebSocketCheck(uint8_t code);
void PowerRelayByWebSocketWarning(uint8_t code);
void PowerRelayByWebSocketTest();
bool setRelayState(uint8_t channel, bool state, bool updateActivationTime = true);
bool setRelayStateAndEndTime(uint8_t channel, bool state, unsigned long endTime);
void startBuzzer(unsigned long duration);
void updateBuzzer();

// ─────────────────────────────────────────────────────────────
// BUZZER NON-BLOCKING
// ─────────────────────────────────────────────────────────────
void startBuzzer(unsigned long duration) {
  digitalWrite(BUZZER, HIGH);
  buzzerActive = true;
  buzzerEndTime = millis() + duration;
}

void updateBuzzer() {
  if (buzzerActive && millis() >= buzzerEndTime) {
    digitalWrite(BUZZER, LOW);
    buzzerActive = false;
  }
}

