Tirta7/voc_master_data_center/esp32_mqtt_client - Copy/KODINGAN_ESP32_PCF8575_SPOT_ON_BILLIARD_SIDOARJO_PORTAL.ino
// ─────────────────────────────────────────────────────────────
// SETUP
// ─────────────────────────────────────────────────────────────
void setup() {
  Serial.begin(115200);
  delay(100);

  if (!SPIFFS.begin(true)) {
    Serial.println("Gagal memulai SPIFFS – restart otomatis");
    ESP.restart();
  }

  // Cek apakah tombol BOOT (GPIO 0) ditekan saat startup
  pinMode(0, INPUT_PULLUP);
  if (digitalRead(0) == LOW) {
    unsigned long pressStart = millis();
    Serial.println("Tombol BOOT ditekan, tahan 5 detik untuk Portal...");
    while (digitalRead(0) == LOW) {
      if (millis() - pressStart > 5000) {
        Serial.println("Reset ke Portal dipicu!");
        SPIFFS.remove(SYSTEM_CONFIG_FILE);
        startPortal();
        return;
      }
      delay(100);
    }
  }

  LoadSystemConfig();

  // Alokasi modul PCF berdasarkan config
  pcfModules = new PCF8575*[config_num_pcf];

  pinMode(MODE_SWITCH, INPUT_PULLUP);
  pinMode(RELAY_CONTROL, OUTPUT);
  pinMode(LED_WIFI, OUTPUT);
  pinMode(BUZZER, OUTPUT);
  pinMode(TRANSISTOR_PIN, OUTPUT);

  digitalWrite(TRANSISTOR_PIN, LOW);
  digitalWrite(RELAY_CONTROL, LOW);
  digitalWrite(LED_WIFI, LOW);
  digitalWrite(BUZZER, LOW);

  Wire.begin();

  for (int i = 0; i < NUM_PCF; i++) {
    Serial.printf("Inisialisasi PCF8575 di alamat 0x%02X...\n", pcfAddresses[i]);
    pcfModules[i] = new PCF8575(pcfAddresses[i]);
    pcfModules[i]->begin();
    for (int j = 0; j < NUM_RELAYS_PER_PCF; j++) {
      pcfModules[i]->write(j, LOW);
    }
  }

  // Watchdog Timer Init
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  esp_task_wdt_config_t wdt_config = {
      .timeout_ms = 30000, .idle_core_mask = 0, .trigger_panic = true};
  esp_task_wdt_reconfigure(&wdt_config);
#else
  esp_task_wdt_init(30, true);
#endif
  esp_task_wdt_add(NULL);

  for (int i = 0; i < NUM_TOTAL_RELAYS; i++) {
    relayState[i] = false;
    relayStateBackup[i] = false;
    relayActivationTime[i] = 0;
    relayEndTime[i] = 0;
  }

  LoadRelayConfigSPIFFS();

  for (int i = 0; i < NUM_TOTAL_RELAYS; i++) {
    setRelayState(i, relayState[i], false);
  }

  modeOtomatis = (digitalRead(MODE_SWITCH) == HIGH);
  Serial.printf("Boot: Mode awal = %s\n", modeOtomatis ? "OTOMATIS" : "MANUAL");

  if (config_ssid == "" || config_ssid == "NULL") {
    Serial.println("SSID belum dikonfigurasi, masuk ke Portal...");
    startPortal();
    return;
  }

  connectToWiFi();
  ConnectWebSocket();

  digitalWrite(TRANSISTOR_PIN, modeOtomatis ? HIGH : LOW);
  digitalWrite(RELAY_CONTROL, modeOtomatis ? HIGH : LOW);
}

// ─────────────────────────────────────────────────────────────
// LOOP UTAMA
// ─────────────────────────────────────────────────────────────
void loop() {
  if (portalActive) {
    dnsServer.processNextRequest();
    server.handleClient();
    return;
  }

  esp_task_wdt_reset();
  unsigned long currentMillis = millis();

  // Dirty Flag Check untuk SPIFFS
  if (storageDirty && (currentMillis - lastStateChange >= STORAGE_SAVE_DELAY)) {
    SaveRelayConfigSPIFFS();
    storageDirty = false;
  }

  // Cek tombol BOOT untuk hard reset saat running
  static unsigned long bootPressStart = 0;
  if (digitalRead(0) == LOW) {
    if (bootPressStart == 0) bootPressStart = millis();
    if (millis() - bootPressStart > 5000) {
      Serial.println("Hard Reset dipicu dari Loop!");
      SPIFFS.remove(SYSTEM_CONFIG_FILE);
      ESP.restart();
    }
  } else {
    bootPressStart = 0;
  }

  cekWiFi(currentMillis);
  webSocket.loop();
  updateBuzzer();

  if (currentMillis - lastPing > pingInterval) {
    lastPing = currentMillis;
    webSocket.sendTXT("{\"event\":\"pusher:ping\"}");
    Serial.println("Mengirim ping ke Reverb...");
  }

  // 🛡️ Heartbeat Level-Aplikasi — Kirim status alat ke server setiap 60 detik
  if (wsConnected && currentMillis - lastHeartbeat >= HEARTBEAT_INTERVAL) {
    lastHeartbeat = currentMillis;
    char hbBuf[300];
    // Bangun string relay state compact
    String relayStr = "";
    for (int i = 0; i < NUM_TOTAL_RELAYS; i++) {
      relayStr += relayState[i] ? "1" : "0";
    }
    snprintf(hbBuf, sizeof(hbBuf),
      "{\"event\":\"client-device.heartbeat\",\"channel\":\"%s\","
      "\"data\":{\"uptime\":%lu,\"relay_count\":%d,\"states\":\"%s\"}}",
      pusher_channel, currentMillis / 1000, NUM_TOTAL_RELAYS, relayStr.c_str());
    webSocket.sendTXT(hbBuf);
    Serial.println("[HEARTBEAT] Dikirim ke server.");
  }

  // ───── DEBOUNCE MODE SWITCH ─────
  static bool lastSwitchReading = HIGH;
  static unsigned long lastDebounceTime = 0;
  const unsigned long debounceDelay = 500; // Ditingkatkan untuk mencegah noise listrik mematikan semua meja
  bool reading = digitalRead(MODE_SWITCH);
  if (reading != lastSwitchReading) lastDebounceTime = millis();
  lastSwitchReading = reading;

  if ((millis() - lastDebounceTime) > debounceDelay) {
    bool newMode = (reading == HIGH);
    if (newMode != modeOtomatis) {
      modeOtomatis = newMode;
      digitalWrite(TRANSISTOR_PIN, modeOtomatis ? HIGH : LOW);
      digitalWrite(RELAY_CONTROL, modeOtomatis ? HIGH : LOW);

      if (modeOtomatis) {
        delay(10);
        LoadRelayConfigSPIFFS();
        for (int i = 0; i < NUM_TOTAL_RELAYS; i++) {
          setRelayState(i, relayState[i], false);
        }
        Serial.println("Mode OTOMATIS: status relay dipulihkan");
      } else {
        for (int i = 0; i < NUM_TOTAL_RELAYS; i++) {
          setRelayState(i, false, false);
        }
        currentState = IDLE;
        Serial.println("Mode MANUAL: semua relay mati");
      }

      startBuzzer(modeOtomatis ? 500 : 300);
      Serial.printf("Mode berubah: %s\n", modeOtomatis ? "OTOMATIS" : "MANUAL");
    }
  }

  // ───── STATE MACHINE ─────
  if (modeOtomatis) {
    switch (currentState) {
      case RUNNING_LIGHT_ON:
        if (currentMillis - stateStartTime >= 500) {
          if (testStep < NUM_TOTAL_RELAYS) {
            setRelayState(testStep, true, false);
            startBuzzer(50);
            testStep++;
            stateStartTime = currentMillis;
          } else {
            currentState = RUNNING_LIGHT_END;
            stateStartTime = currentMillis;
          }
        }
        break;

