Tirta7/voc_master_data_center/esp32_mqtt_client - Copy/KODINGAN_ESP32_PCF8575_SPOT_ON_BILLIARD_SIDOARJO_PORTAL.ino
      case RUNNING_LIGHT_END:
        for (int i = 0; i < NUM_TOTAL_RELAYS; i++) {
          setRelayState(i, relayStateBackup[i], false);
        }
        startBuzzer(100);
        currentState = IDLE;
        Serial.println("Running light test selesai");
        break;

      case WARNING_BLINK:
        if (currentMillis - stateStartTime >= 400) {
          bool newState = (warningBlinkCount % 2 == 1);
          setRelayState(warningCode - 1, newState, false);
          startBuzzer(50);
          warningBlinkCount++;
          stateStartTime = currentMillis;
          if (warningBlinkCount >= 6) {
            setRelayState(warningCode - 1, true, false);
            currentState = IDLE;
            Serial.println("Warning selesai");
          }
        }
        break;
    }
  }
}

// ─────────────────────────────────────────────────────────────
// FUNGSI JARINGAN
// ─────────────────────────────────────────────────────────────
void connectToWiFi() {
  Serial.print("\nMenghubungkan ke WiFi: ");
  Serial.println(config_ssid);
  WiFi.setAutoReconnect(true);
  esp_wifi_set_ps(WIFI_PS_NONE); // Matikan hemat daya agar responsif
  WiFi.begin(config_ssid.c_str(), config_password.c_str());

  unsigned long startTime = millis();
  while (WiFi.status() != WL_CONNECTED && (millis() - startTime) < 10000) {
    digitalWrite(LED_WIFI, (millis() / 500) % 2);
    delay(10);
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWiFi terhubung!");
    Serial.print("IP Address: ");
    Serial.println(WiFi.localIP());
    Serial.println("08-9999-64538");
    digitalWrite(LED_WIFI, HIGH);
    wifiConnected = true;
    startBuzzer(1000);
  } else {
    Serial.println("\nGagal terhubung ke WiFi");
    digitalWrite(LED_WIFI, LOW);
  }
}

void cekWiFi(unsigned long currentMillis) {
  if (currentMillis - lastWiFiCheck >= 5000) {
    lastWiFiCheck = currentMillis;
    if (WiFi.status() != WL_CONNECTED) {
      if (wifiConnected) {
        Serial.println("WiFi terputus!");
        digitalWrite(LED_WIFI, LOW);
        wifiConnected = false;
        startBuzzer(1000);
      }
    } else if (!wifiConnected) {
      digitalWrite(LED_WIFI, HIGH);
      wifiConnected = true;
    }
  }
}

// ─────────────────────────────────────────────────────────────
// WEBSOCKET EVENT
// ─────────────────────────────────────────────────────────────
void WebSocketEvent(WStype_t type, uint8_t* payload, size_t length) {
  switch (type) {
    case WStype_DISCONNECTED:
      Serial.println("WebSocket: Terputus");
      wsConnected = false;
      // 🛡️ State Machine Recovery: Jika WebSocket putus saat WARNING_BLINK berjalan,
      // relay bisa tertinggal dalam kondisi MATI. Paksa ON agar meja tidak mati permanen.
      if (currentState == WARNING_BLINK) {
        Serial.printf("[RECOVERY] Disconnect saat WARNING_BLINK relay %d! Paksa relay ON.\n", warningCode);
        setRelayState(warningCode - 1, true, false);
        currentState = IDLE;
      }
      // 🛡️ Jika disconnect saat RUNNING_LIGHT_ON, restore semua relay ke backup
      if (currentState == RUNNING_LIGHT_ON || currentState == RUNNING_LIGHT_END) {
        for (int i = 0; i < NUM_TOTAL_RELAYS; i++) {
          setRelayState(i, relayStateBackup[i], false);
        }
        currentState = IDLE;
        Serial.println("[RECOVERY] Running light dibatalkan, relay di-restore.");
      }
      digitalWrite(LED_WIFI, LOW);
      break;

    case WStype_CONNECTED:
      Serial.println("WebSocket: Terhubung ke Reverb");
      wsConnected = true;
      // 🛡️ Paksa state machine ke IDLE saat reconnect agar tidak ada state yang menggantung
      if (currentState != IDLE) {
        if (currentState == WARNING_BLINK) setRelayState(warningCode - 1, true, false);
        currentState = IDLE;
        Serial.println("[RECOVERY] State machine di-reset ke IDLE saat reconnect.");
      }
      // Subscribe ke semua channel
      char msgBuf[128];
      for (size_t i = 0; i < numPusherChannels; i++) {
        int len = snprintf(msgBuf, sizeof(msgBuf), subscribeTemplate, pusherChannels[i]);
        if (len > 0 && len < (int)sizeof(msgBuf)) {
          webSocket.sendTXT(msgBuf);
          Serial.print("Subscribe ke: ");
          Serial.println(pusherChannels[i]);
        }
      }
      // 🛡️ Kirim sync request: beritahu server bahwa alat baru online dengan status relay saat ini
      {
        String relayStr = "";
        for (int i = 0; i < NUM_TOTAL_RELAYS; i++) {
          relayStr += relayState[i] ? "1" : "0";
        }
        char syncBuf[350];
        snprintf(syncBuf, sizeof(syncBuf),
          "{\"event\":\"client-device.online\",\"channel\":\"%s\","
          "\"data\":{\"num_relays\":%d,\"states\":\"%s\",\"uptime\":%lu}}",
          pusher_channel, NUM_TOTAL_RELAYS, relayStr.c_str(), millis() / 1000);
        webSocket.sendTXT(syncBuf);
        Serial.println("[SYNC] Device online broadcast dikirim ke server.");
      }
      digitalWrite(LED_WIFI, HIGH);
      break;

    case WStype_TEXT: {
      deserializeJson(doc, payload);
      if (doc.isNull()) { Serial.println("JSON tidak valid"); return; }

      const char* event = doc["event"];
      if (!event) { Serial.println("Pesan tanpa field 'event'"); return; }

      if (strncmp(event, "pusher:", 7) == 0) {
        if (strcmp(event, "pusher:pong") == 0) Serial.println("Pong diterima");
        else if (strcmp(event, "pusher:connection_established") == 0) Serial.println("Koneksi WebSocket stabil");
        else if (strcmp(event, "pusher:error") == 0) {
          const char* errorMsg = doc["data"];
          Serial.print("Pusher Error: ");
          Serial.println(errorMsg ? errorMsg : "Tidak ada detail");
        }
        return;
      }

      if (strcmp(event, pusher_event_connec) == 0) {
        const char* dataPayload = doc["data"];
        deserializeJson(dataDoc, dataPayload);
        uint8_t code = dataDoc["code"];
        const char* status = dataDoc["status"];
        unsigned long durationMs = dataDoc["duration_ms"] | 0;
        PowerRelayByWebSocket(code, status, durationMs);
      }
      else if (strcmp(event, pusher_event_check) == 0) {
        const char* dataPayload = doc["data"];
        deserializeJson(dataDoc, dataPayload);
        uint8_t code = dataDoc["code"];
        PowerRelayByWebSocketCheck(code);
      }
      else if (strcmp(event, pusher_event_warn) == 0) {
        const char* dataPayload = doc["data"];
        deserializeJson(dataDoc, dataPayload);
        uint8_t code = dataDoc["code"];
        PowerRelayByWebSocketWarning(code);
      }
      else if (strcmp(event, pusher_event_test) == 0) {
        PowerRelayByWebSocketTest();
      }
      else {
        Serial.printf("Event tidak dikenali: %s\n", event);
      }
      break;
    }
  }
}

void ConnectWebSocket() {
  char url[128];
  snprintf(url, sizeof(url),
           "/app/%s?protocol=7&client=esp32&version=1.0&flash=false",
           reverb_app_key);
  webSocket.begin(config_host_ip.c_str(), reverb_port, url);
  webSocket.onEvent(WebSocketEvent);
  webSocket.setReconnectInterval(10000);
  Serial.println("Menghubungkan ke Reverb WebSocket...");
}

