Tirta7/voc_master_data_center/esp32_mqtt_client - Copy/KODINGAN_ESP32_PCF8575_SPOT_ON_BILLIARD_SIDOARJO_PORTAL.ino
// ─────────────────────────────────────────────────────────────
// HANDLER WEBSOCKET
// ─────────────────────────────────────────────────────────────
void PowerRelayByWebSocket(uint8_t code, const char* status, unsigned long durationMs) {
  if (code == 0 || code > NUM_TOTAL_RELAYS) {
    Serial.printf("Kode relay tidak valid: %d (harus 1-%d)\n", code, NUM_TOTAL_RELAYS);
    return;
  }
  bool activate = (strcmp(status, "active") == 0);
  uint8_t relayIndex = code - 1;
  unsigned long now = millis();

  // Batalkan warning jika meja ini sedang berkedip
  if (currentState == WARNING_BLINK && warningCode == code) {
    currentState = IDLE;
  }

  if (!activate) {
    // 🛡️ Anti-Race Condition Multi-Waiter: Tolak perintah OFF jika relay masih diproteksi
    // Ini mencegah Waiter B mematikan meja yang baru saja dinyalakan Waiter A
    if (relayProtectedUntil[relayIndex] > now) {
      Serial.printf("[PROTECT] OFF relay %d DITOLAK! Proteksi aktif sisa %lu detik.\n",
        code, (relayProtectedUntil[relayIndex] - now) / 1000);
      return;
    }
    if (setRelayState(relayIndex, false)) {
      relayEndTime[relayIndex] = 0;
      startBuzzer(500);
      storageDirty = true;
      lastStateChange = now;
      Serial.printf("Relay %d MATI\n", code);
    }
  } else {
    // Deteksi apakah ini perintah Extend (relay sudah ON dan ada durasi baru)
    bool isExtend = (relayState[relayIndex] == true && durationMs > 0);

    // 🛡️ Proteksi 500ms (ON biasa) atau 60 detik (Extend) agar waiter lain tidak bisa
    // memicu perintah OFF/toggle yang bertabrakan dalam waktu dekat
    relayProtectedUntil[relayIndex] = now + (isExtend ? 60000UL : 500UL);

    // Jika durationMs 0 (Open Table), endTime harus 0 agar tidak memicu warning prematur
    unsigned long endTime = (durationMs > 0) ? (now + durationMs) : 0;
    if (setRelayStateAndEndTime(relayIndex, true, endTime)) {
      startBuzzer(isExtend ? 300 : 500);
      storageDirty = true;
      lastStateChange = now;
      Serial.printf("Relay %d %s, durasi: %lu ms\n", code,
        isExtend ? "NYALA (EXTEND)" : "NYALA", durationMs);
    }
  }
}

void PowerRelayByWebSocketCheck(uint8_t code) {
  if (code == 0 || code > NUM_TOTAL_RELAYS) return;
  uint8_t relayIndex = code - 1;
  unsigned long now = millis();

  // 🛡️ Cek proteksi: jika relay sedang dalam window proteksi, tolak perintah check
  // Mencegah waiter yang stres double-klik dari membuat relay toggle bolak-balik
  if (relayProtectedUntil[relayIndex] > now) {
    Serial.printf("[PROTECT] Check relay %d DITOLAK (masih diproteksi, sisa %lu detik).\n",
      code, (relayProtectedUntil[relayIndex] - now) / 1000);
    return;
  }

  bool newState = !relayState[relayIndex];
  relayProtectedUntil[relayIndex] = now + 500; // Proteksi 500ms setelah toggle
  if (setRelayState(relayIndex, newState)) {
    startBuzzer(500);
    storageDirty = true;
    lastStateChange = now;
    Serial.printf("Relay %d -> %s\n", code, newState ? "ON" : "OFF");
  }
}

void PowerRelayByWebSocketWarning(uint8_t code) {
  if (code == 0 || code > NUM_TOTAL_RELAYS) {
    Serial.printf("Kode relay tidak valid untuk warning: %d\n", code);
    return;
  }
  if (currentState != IDLE) {
    Serial.println("Warning ditolak: Sedang ada animasi/warning lain berjalan.");
    return;
  }
  if (!modeOtomatis) {
    Serial.println("Mode MANUAL aktif - lewati perintah warning");
    return;
  }
  uint8_t relayIndex = code - 1;
  if (!relayState[relayIndex]) {
    Serial.printf("Warning ditolak: Relay %d mati.\n", code);
    return;
  }
  unsigned long currentTime = millis();
  unsigned long timeSinceActivation = currentTime - relayActivationTime[relayIndex];
  if (timeSinceActivation < MIN_TIME_BEFORE_WARNING_MS) {
    Serial.printf("Warning ditolak: Relay %d baru nyala %lu ms lalu.\n", code, timeSinceActivation);
    return;
  }
  if (relayEndTime[relayIndex] == 0) {
    Serial.printf("Warning ditolak: Relay %d tidak punya waktu akhir.\n", code);
    return;
  }
  unsigned long timeRemaining = (currentTime < relayEndTime[relayIndex]) ? (relayEndTime[relayIndex] - currentTime) : 0;
  if (timeRemaining > WARNING_THRESHOLD_MS) {
    Serial.printf("Warning ditolak: Waktu tersisa %lu ms > 5 menit.\n", timeRemaining);
    return;
  }
  Serial.printf("Peringatan diterima untuk relay %d. Waktu tersisa: %lu ms.\n", code, timeRemaining);
  warningCode = code;
  warningBlinkCount = 0;
  currentState = WARNING_BLINK;
  stateStartTime = millis();
}

void PowerRelayByWebSocketTest() {
  if (!modeOtomatis) return;
  if (currentState != IDLE) return;
  for (int i = 0; i < NUM_TOTAL_RELAYS; i++) {
    relayStateBackup[i] = relayState[i];
  }
  Serial.println("Memulai running light test...");
  testStep = 0;
  currentState = RUNNING_LIGHT_ON;
  stateStartTime = millis();
}

// ─────────────────────────────────────────────────────────────
// SET RELAY STATE
// ─────────────────────────────────────────────────────────────
bool setRelayState(uint8_t channel, bool state, bool updateActivationTime) {
  if (channel >= NUM_TOTAL_RELAYS) {
    Serial.printf("Error: Channel %d melebihi batas (%d)\n", channel, NUM_TOTAL_RELAYS);
    return false;
  }
  if (state && updateActivationTime) {
    relayActivationTime[channel] = millis();
  }
  relayState[channel] = state;

  int pcfIndex = channel / NUM_RELAYS_PER_PCF;
  int pcfPin = channel % NUM_RELAYS_PER_PCF;

  // Pastikan tidak melebihi jumlah modul
  if (pcfIndex >= NUM_PCF) {
    Serial.printf("Error: Relay %d memerlukan PCF ke-%d, tapi hanya ada %d modul\n", channel, pcfIndex, NUM_PCF);
    return false;
  }

  Wire.beginTransmission(pcfAddresses[pcfIndex]);
  if (Wire.endTransmission() != 0) {
    Serial.printf("I2C Error: Modul %d offline, mencoba re-init...\n", pcfIndex);
    pcfModules[pcfIndex]->begin();
  }

  pcfModules[pcfIndex]->write(pcfPin, state ? HIGH : LOW);
  // Library PCF8575 baru tidak mengembalikan nilai bool
  bool success = true; 
  return success;
}

bool setRelayStateAndEndTime(uint8_t channel, bool state, unsigned long endTime) {
  bool success = setRelayState(channel, state, true);
  if (success) relayEndTime[channel] = endTime;
  return success;
}

