Tirta7/voc_master_data_center/esp32_mqtt_client - Copy/KODINGAN_ESP32_PCF8575_SPOT_ON_BILLIARD_SIDOARJO_PORTAL.ino
// ─────────────────────────────────────────────────────────────
// SPIFFS CONFIG (AMAN & OTOMATIS RECOVERY)
// ─────────────────────────────────────────────────────────────
void SaveRelayConfigSPIFFS() {
  DynamicJsonDocument saveDoc(4096);
  saveDoc["numRelays"] = NUM_TOTAL_RELAYS;
  JsonArray relaysArray = saveDoc.createNestedArray("relayState");
  JsonArray endTimeArray = saveDoc.createNestedArray("relayEndTime");
  for (uint8_t i = 0; i < NUM_TOTAL_RELAYS; i++) {
    relaysArray.add(relayState[i]);
    endTimeArray.add(relayEndTime[i]);
  }

  File configFile = SPIFFS.open(CONFIG_FILE, FILE_WRITE);
  if (!configFile) {
    Serial.println("Gagal membuka file untuk menulis");
    return;
  }

  size_t written = serializeJson(saveDoc, configFile);
  configFile.close();

  if (written == 0) {
    Serial.println("Gagal menyimpan konfigurasi");
  } else {
    Serial.println("Konfigurasi relay disimpan ke SPIFFS");
  }
}

void LoadRelayConfigSPIFFS() {
  if (!SPIFFS.exists(CONFIG_FILE)) {
    Serial.println("File konfigurasi tidak ada – gunakan default (semua relay MATI)");
    return;
  }

  File configFile = SPIFFS.open(CONFIG_FILE, FILE_READ);
  if (!configFile) {
    Serial.println("Gagal membuka file konfigurasi");
    return;
  }

  size_t fileSize = configFile.size();
  if (fileSize == 0) {
    Serial.println("File konfigurasi kosong – hapus dan gunakan default");
    configFile.close();
    SPIFFS.remove(CONFIG_FILE);
    return;
  }

  String content = configFile.readString();
  configFile.close();

  DynamicJsonDocument loadDoc(4096);
  DeserializationError err = deserializeJson(loadDoc, content.c_str());
  if (err) {
    Serial.print("JSON tidak valid: ");
    Serial.println(err.f_str());
    Serial.println("File korup – hapus dan gunakan default");
    SPIFFS.remove(CONFIG_FILE);
    return;
  }

  if (!loadDoc["numRelays"].is<uint8_t>()) {
    Serial.println("Field 'numRelays' tidak ditemukan atau tidak valid");
    return;
  }

  uint8_t savedNumRelays = loadDoc["numRelays"];
  if (savedNumRelays != NUM_TOTAL_RELAYS) {
    Serial.printf("Jumlah relay tidak cocok: file=%d, sistem=%d – abaikan file\n", savedNumRelays, NUM_TOTAL_RELAYS);
    return;
  }

  JsonArray stateArr = loadDoc["relayState"].as<JsonArray>();
  JsonArray endArr = loadDoc["relayEndTime"].as<JsonArray>();

  if (stateArr.isNull() || endArr.isNull() ||
      stateArr.size() != NUM_TOTAL_RELAYS || endArr.size() != NUM_TOTAL_RELAYS) {
    Serial.println("Ukuran array tidak sesuai – abaikan file");
    return;
  }

  for (uint8_t i = 0; i < NUM_TOTAL_RELAYS; i++) {
    relayState[i] = stateArr[i].as<bool>();
    // 🛡️ TIDAK restore relayEndTime! millis() selalu mulai dari 0 setelah restart.
    // Jika di-restore, nilai lama (misal: 3600000) akan dianggap masih valid padahal sudah lewat.
    // Ini menyebabkan: warning prematur, timer hantu, atau meja tidak bisa di-warning sama sekali.
    // Solusi: Server akan kirim ulang state terbaru via WebSocket saat device.online event diterima.
    relayEndTime[i] = 0;
    relayStateBackup[i] = relayState[i];
  }
  Serial.println("[SPIFFS] Status relay di-restore. Timer di-reset (perlu sync dari server).");
}

// ─────────────────────────────────────────────────────────────
// SYSTEM CONFIG & PORTAL
// ─────────────────────────────────────────────────────────────
void LoadSystemConfig() {
  if (!SPIFFS.exists(SYSTEM_CONFIG_FILE)) {
    Serial.println("System config not found.");
    return;
  }
  File f = SPIFFS.open(SYSTEM_CONFIG_FILE, "r");
  if (f) {
    StaticJsonDocument<1024> sdoc;
    DeserializationError err = deserializeJson(sdoc, f);
    if (!err) {
      config_ssid = sdoc["ssid"] | "";
      config_password = sdoc["pass"] | "";
      config_host_ip = sdoc["host"] | "192.168.1.199";
      pin_mode_switch = sdoc["p_mode"] | 5;
      pin_transistor = sdoc["p_trans"] | 4;
      pin_relay_control = sdoc["p_relay"] | 15;
      pin_led_wifi = sdoc["p_led"] | 2;
      pin_buzzer = sdoc["p_buzz"] | 19;
      config_num_pcf = sdoc["n_pcf"] | 2;
      config_pcf_addrs = sdoc["a_pcf"] | "0x21,0x22";
      
      // Parse addresses
      char buf[64];
      strncpy(buf, config_pcf_addrs.c_str(), sizeof(buf));
      char* p = strtok(buf, ",");
      int i = 0;
      while(p != NULL && i < 8) {
        pcfAddresses[i++] = (uint8_t)strtol(p, NULL, 0);
        p = strtok(NULL, ",");
      }
      Serial.println("System config loaded.");
    }
    f.close();
  }
}

void SaveSystemConfig() {
  File f = SPIFFS.open(SYSTEM_CONFIG_FILE, "w");
  if (f) {
    StaticJsonDocument<1024> sdoc;
    sdoc["ssid"] = config_ssid;
    sdoc["pass"] = config_password;
    sdoc["host"] = config_host_ip;
    sdoc["p_mode"] = pin_mode_switch;
    sdoc["p_trans"] = pin_transistor;
    sdoc["p_relay"] = pin_relay_control;
    sdoc["p_led"] = pin_led_wifi;
    sdoc["p_buzz"] = pin_buzzer;
    sdoc["n_pcf"] = config_num_pcf;
    sdoc["a_pcf"] = config_pcf_addrs;
    serializeJson(sdoc, f);
    f.close();
    Serial.println("System config saved.");
  }
}

void startPortal() {
  portalActive = true;
  WiFi.mode(WIFI_AP);
  WiFi.softAP("ESP32-SPOT-ON-PORTAL");
  
  dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
  
  server.on("/", handlePortalRoot);
  server.on("/save", HTTP_POST, handlePortalSave);
  server.on("/scan", handlePortalScan);
  server.onNotFound([]() {
    server.sendHeader("Location", "/", true);
    server.send(302, "text/plain", "");
  });
  
  server.begin();
  Serial.print("Portal AP IP: ");
  Serial.println(WiFi.softAPIP());
  
  // Blink LED to indicate portal mode
  for(int i=0; i<10; i++) {
    digitalWrite(LED_WIFI, HIGH); delay(100);
    digitalWrite(LED_WIFI, LOW); delay(100);
  }
}

void handlePortalRoot() {
  String html = "<!DOCTYPE html><html><head>"
    "<meta name='viewport' content='width=device-width, initial-scale=1.0'>"
    "<title>Config Portal</title>"
    "<style>"
    "body { font-family: 'Segoe UI', Tahoma, Geneva, Verdana, sans-serif; background: linear-gradient(135deg, #1a1a2e 0%, #16213e 100%); color: white; display: flex; justify-content: center; align-items: center; min-height: 100vh; margin: 0; padding: 20px; box-sizing: border-box; }"
    ".card { background: rgba(255, 255, 255, 0.05); backdrop-filter: blur(10px); border-radius: 20px; padding: 30px; width: 100%; max-width: 450px; box-shadow: 0 8px 32px 0 rgba(0, 0, 0, 0.37); border: 1px solid rgba(255, 255, 255, 0.1); }"
    "h2 { text-align: center; margin-bottom: 30px; color: #4ecca3; font-weight: 300; letter-spacing: 2px; }"
    ".input-group { margin-bottom: 20px; position: relative; }"
    "label { display: block; margin-bottom: 8px; font-size: 0.9em; color: #a2a2a2; }"
    "input { width: 100%; padding: 12px; border-radius: 8px; border: 1px solid rgba(255,255,255,0.1); background: rgba(255,255,255,0.05); color: white; box-sizing: border-box; outline: none; transition: 0.3s; }"
    "input:focus { border-color: #4ecca3; background: rgba(255,255,255,0.1); }"
    ".row { display: flex; gap: 10px; flex-wrap: wrap; }"
    ".row .input-group { flex: 1; min-width: 140px; }"
    "button { width: 100%; padding: 14px; border: none; border-radius: 8px; background: #4ecca3; color: #1a1a2e; font-weight: bold; cursor: pointer; transition: 0.3s; margin-top: 10px; }"
    "button:hover { background: #45b393; transform: translateY(-2px); }"
    ".scan-btn { background: #3498db; color: white; padding: 8px 12px; font-size: 0.8em; margin-top: 5px; width: auto; }"
    ".toggle-pass { position: absolute; right: 10px; top: 38px; cursor: pointer; color: #a2a2a2; }"
    "#networks { margin-top: 10px; font-size: 0.85em; max-height: 150px; overflow-y: auto; background: rgba(0,0,0,0.2); border-radius: 5px; padding: 5px; display: none; }"
    ".net-item { padding: 8px; cursor: pointer; border-bottom: 1px solid rgba(255,255,255,0.05); }"
    ".net-item:hover { background: rgba(255,255,255,0.1); }"
    "</style></head><body>"
    "<div class='card'>"
    "<h2>CONFIG PORTAL</h2>"
    "<form action='/save' method='POST'>"
    "<div class='input-group'>"
    "<label>SSID</label>"
    "<input name='ssid' id='ssid' value='" + config_ssid + "'>"
    "<button type='button' class='scan-btn' onclick='scanWiFi()'>Scan WiFi</button>"
    "<div id='networks'></div>"
    "</div>"
    "<div class='input-group'>"
    "<label>Password</label>"
    "<input name='pass' id='pass' type='password' value='" + config_password + "'>"
    "<span class='toggle-pass' onclick='togglePass()'>👁️</span>"
    "</div>"
    "<div class='input-group'>"
    "<label>Host Static IP</label>"
    "<input name='host' value='" + config_host_ip + "'>"
    "</div>"
    "<div class='row'>"
    "<div class='input-group'><label>MODE SWITCH</label><input name='p_mode' type='number' placeholder='5' value='" + String(pin_mode_switch) + "'></div>"
    "<div class='input-group'><label>TRANSISTOR</label><input name='p_trans' type='number' placeholder='4' value='" + String(pin_transistor) + "'></div>"
    "</div>"
    "<div class='row'>"
    "<div class='input-group'><label>RELAY CONTROL</label><input name='p_relay' type='number' placeholder='15' value='" + String(pin_relay_control) + "'></div>"
    "<div class='input-group'><label>LED WIFI</label><input name='p_led' type='number' placeholder='2' value='" + String(pin_led_wifi) + "'></div>"
    "<div class='input-group'><label>BUZZER</label><input name='p_buzz' type='number' placeholder='19' value='" + String(pin_buzzer) + "'></div>"
    "</div>"
    "<div class='row' style='background: rgba(78, 204, 163, 0.05); padding: 15px; border-radius: 10px; border: 1px solid rgba(78, 204, 163, 0.2); margin-top: 10px;'>"
    "<div class='input-group' style='flex: 0 0 100px;'><label>NUM PCF</label><input name='n_pcf' type='number' placeholder='2' value='" + String(config_num_pcf) + "'></div>"
    "<div class='input-group'><label>I2C ADDRESSES (comma separated)</label><input name='a_pcf' placeholder='0x21,0x22' value='" + config_pcf_addrs + "'></div>"
    "</div>"
    "<button type='submit'>SIMPAN PENGATURAN</button>"
    "</form>"
    "</div>"
    "<script>"
    "function togglePass() { var x = document.getElementById('pass'); x.type = (x.type === 'password') ? 'text' : 'password'; }"
    "function scanWiFi() { "
    "  var btn = document.querySelector('.scan-btn'); btn.innerText = 'Scanning...'; "
    "  fetch('/scan').then(r => r.json()).then(data => { "
    "    var div = document.getElementById('networks'); div.innerHTML = ''; div.style.display = 'block'; "
    "    data.forEach(n => { "
    "      var item = document.createElement('div'); item.className = 'net-item'; "
    "      item.innerText = n.ssid + ' (' + n.rssi + 'dBm)'; "
    "      item.onclick = () => { document.getElementById('ssid').value = n.ssid; div.style.display = 'none'; }; "
    "      div.appendChild(item); "
    "    }); "
    "    btn.innerText = 'Scan WiFi'; "
    "  }); "
    "}"
    "</script></body></html>";
  server.send(200, "text/html", html);
}

void handlePortalScan() {
  int n = WiFi.scanNetworks();
  String json = "[";
  for (int i = 0; i < n; i++) {
    if (i > 0) json += ",";
    json += "{\"ssid\":\"" + WiFi.SSID(i) + "\",\"rssi\":" + String(WiFi.RSSI(i)) + "}";
  }
  json += "]";
  server.send(200, "application/json", json);
}

void handlePortalSave() {
  config_ssid = server.arg("ssid");
  config_password = server.arg("pass");
  config_host_ip = server.arg("host");
  pin_mode_switch = server.arg("p_mode").toInt();
  pin_transistor = server.arg("p_trans").toInt();
  pin_relay_control = server.arg("p_relay").toInt();
  pin_led_wifi = server.arg("p_led").toInt();
  pin_buzzer = server.arg("p_buzz").toInt();
  config_num_pcf = server.arg("n_pcf").toInt();
  config_pcf_addrs = server.arg("a_pcf");
  
  SaveSystemConfig();
  
  String html = "<!DOCTYPE html><html><head><meta name='viewport' content='width=device-width, initial-scale=1.0'><style>"
    "body { font-family: sans-serif; background: #1a1a2e; color: white; display: flex; justify-content: center; align-items: center; height: 100vh; text-align: center; }"
    ".card { background: rgba(255,255,255,0.05); padding: 40px; border-radius: 20px; }"
    "h2 { color: #4ecca3; }"
    "</style></head><body><div class='card'>"
    "<h2>PENGATURAN DISIMPAN!</h2>"
    "<p>ESP32 akan restart dan mencoba terhubung ke WiFi.</p>"
    "<p><b>IP Address:</b> Sedang menyambung...</p>"
    "<p>Mohon tunggu sebentar.</p>"
    "</div><script>setTimeout(() => { window.location.href = '/'; }, 5000);</script></body></html>";
  
  server.send(200, "text/html", html);
  delay(2000);
  ESP.restart();
}